const GAS_LIMIT = 626948;

/*
================================================================================================
Можна використовувати тільки одну з двох перемінних ACCS_PACK або ACCS_NUMBERS
Якщо ACCS_PACK має значення наприклад [0, 4] тоді ACCS_NUMBERS повинна бути пуста [] і наоборот
================================================================================================
Пачка акаунтів. Наприклад якщо значення [7, 30] то будуть використовуватись 7-30 акаунти
Нумерація починається з 0
*/
const ACCS_PACK = [];

/*
Номери акаунтів. Приклад [1, 0, 4, 10, 3]
Нумерація починається з 0
*/
const ACCS_NUMBERS = [12, 3];
//==============================================================================================

/*
0 - свап ETH-USDC (якщо на балансі будуть USDC тоді свап USDC-ETH)
1 - врап ETH-WETH (якщо на балансі будуть WETH тоді анврап)
*/
const SWAP_TYPE = 0;

/*
Максимальний газ в Ефір мережі.
Якщо газ буде більший скрипт буде очікувати допустимий газ.
*/
const ALLOWED_GWEI = 27;

/*
Перемішати адреси
0 - ні
1 - так 
*/
const RANDOMIZE_WALLETS = 0;

/*
Відсоток від баланса (ETH) який буде свапатися
*/
const AMOUNT_OUT_PERCENT = 2.61;

/*
Затримка між акаунтами
Перша цифра мінімальна затримка друга максимальна в секундах.
*/
const DELAY_ACC = [2000, 3000];

/*
Затримка (в секундах) між перевірками газу коли він вищий за значення ALLOWED_GWEI
*/
const CHECK_GAS_DELAY = 300;

/*
Скільки токенів USDC апрувати
*/
const APPROVE_AMOUNT = [3, 10];

module.exports = {
  ACCS_PACK,
  ACCS_NUMBERS,
  AMOUNT_OUT_PERCENT,
  DELAY_ACC,
  ALLOWED_GWEI,
  CHECK_GAS_DELAY,
  SWAP_TYPE,
  APPROVE_AMOUNT,
  GAS_LIMIT,
  RANDOMIZE_WALLETS,
};
